zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/MCX/MCXE/periph6/PERI_DMA.h
    __IO uint16_t TCD18_BITER_ELINKYES;              /**< TCD Beginning Major Loop Count (Minor Loop Channel Linking Enabled), offset: 0x21C03E */
  };
       uint8_t RESERVED_16[16320];
  __IO uint32_t CH19_CSR;                          /**< Channel Control and Status, offset: 0x220000 */
  __IO uint32_t CH19_ES;                           /**< Channel Error Status, offset: 0x220004 */
  __IO uint32_t CH19_INT;                          /**< Channel Interrupt Status, offset: 0x220008 */
  __IO uint32_t CH19_SBR;                          /**< Channel System Bus, offset: 0x22000C */
  __IO uint32_t CH19_PRI;                          /**< Channel Priority, offset: 0x220010 */
       uint8_t RESERVED_17[12];
  __IO uint32_t TCD19_SADDR;                       /**< TCD Source Address, offset: 0x220020 */
  __IO uint16_t TCD19_SOFF;                        /**< TCD Signed Source Address Offset, offset: 0x220024 */
  __IO uint16_t TCD19_ATTR;                        /**< TCD Transfer Attributes, offset: 0x220026 */
  union {                                          /* offset: 0x220028 */
    __IO uint32_t TCD19_NBYTES_MLOFFNO;              /**< TCD Transfer Size Without Minor Loop Offsets, offset: 0x220028 */
    __IO uint32_t TCD19_NBYTES_MLOFFYES;             /**< TCD Transfer Size with Minor Loop Offsets, offset: 0x220028 */
  };
  __IO uint32_t TCD19_SLAST_SDA;                   /**< TCD Last Source Address Adjustment / Store DADDR Address, offset: 0x22002C */
  __IO uint32_t TCD19_DADDR;                       /**< TCD Destination Address, offset: 0x220030 */
  __IO uint16_t TCD19_DOFF;                        /**< TCD Signed Destination Address Offset, offset: 0x220034 */
  union {                                          /* offset: 0x220036 */
    __IO uint16_t TCD19_CITER_ELINKNO;               /**< TCD Current Major Loop Count (Minor Loop Channel Linking Disabled), offset: 0x220036 */
    __IO uint16_t TCD19_CITER_ELINKYES;              /**< TCD Current Major Loop Count (Minor Loop Channel Linking Enabled), offset: 0x220036 */
  };
  __IO uint32_t TCD19_DLAST_SGA;                   /**< TCD Last Destination Address Adjustment / Scatter Gather Address, offset: 0x220038 */
  __IO uint16_t TCD19_CSR;                         /**< TCD Control and Status, offset: 0x22003C */
  union {                                          /* offset: 0x22003E */
    __IO uint16_t TCD19_BITER_ELINKNO;               /**< TCD Beginning Major Loop Count (Minor Loop Channel Linking Disabled), offset: 0x22003E */
    __IO uint16_t TCD19_BITER_ELINKYES;              /**< TCD Beginning Major Loop Count (Minor Loop Channel Linking Enabled), offset: 0x22003E */
  };
       uint8_t RESERVED_18[16320];
  __IO uint32_t CH20_CSR;                          /**< Channel Control and Status, offset: 0x224000 */
  __IO uint32_t CH20_ES;                           /**< Channel Error Status, offset: 0x224004 */
  __IO uint32_t CH20_INT;                          /**< Channel Interrupt Status, offset: 0x224008 */
  __IO uint32_t CH20_SBR;                          /**< Channel System Bus, offset: 0x22400C */
  __IO uint32_t CH20_PRI;                          /**< Channel Priority, offset: 0x224010 */
       uint8_t RESERVED_19[12];
  __IO uint32_t TCD20_SADDR;                       /**< TCD Source Address, offset: 0x224020 */
  __IO uint16_t TCD20_SOFF;                        /**< TCD Signed Source Address Offset, offset: 0x224024 */
  __IO uint16_t TCD20_ATTR;                        /**< TCD Transfer Attributes, offset: 0x224026 */
  union {                                          /* offset: 0x224028 */
    __IO uint32_t TCD20_NBYTES_MLOFFNO;              /**< TCD Transfer Size Without Minor Loop Offsets, offset: 0x224028 */
    __IO uint32_t TCD20_NBYTES_MLOFFYES;             /**< TCD Transfer Size with Minor Loop Offsets, offset: 0x224028 */
  };
  __IO uint32_t TCD20_SLAST_SDA;                   /**< TCD Last Source Address Adjustment / Store DADDR Address, offset: 0x22402C */
  __IO uint32_t TCD20_DADDR;                       /**< TCD Destination Address, offset: 0x224030 */
  __IO uint16_t TCD20_DOFF;                        /**< TCD Signed Destination Address Offset, offset: 0x224034 */
  union {                                          /* offset: 0x224036 */
    __IO uint16_t TCD20_CITER_ELINKNO;               /**< TCD Current Major Loop Count (Minor Loop Channel Linking Disabled), offset: 0x224036 */
    __IO uint16_t TCD20_CITER_ELINKYES;              /**< TCD Current Major Loop Count (Minor Loop Channel Linking Enabled), offset: 0x224036 */
  };
  __IO uint32_t TCD20_DLAST_SGA;                   /**< TCD Last Destination Address Adjustment / Scatter Gather Address, offset: 0x224038 */
  __IO uint16_t TCD20_CSR;                         /**< TCD Control and Status, offset: 0x22403C */
  union {                                          /* offset: 0x22403E */
    __IO uint16_t TCD20_BITER_ELINKNO;               /**< TCD Beginning Major Loop Count (Minor Loop Channel Linking Disabled), offset: 0x22403E */
    __IO uint16_t TCD20_BITER_ELINKYES;              /**< TCD Beginning Major Loop Count (Minor Loop Channel Linking Enabled), offset: 0x22403E */
  };
       uint8_t RESERVED_20[16320];
  __IO uint32_t CH21_CSR;                          /**< Channel Control and Status, offset: 0x228000 */
  __IO uint32_t CH21_ES;                           /**< Channel Error Status, offset: 0x228004 */
  __IO uint32_t CH21_INT;                          /**< Channel Interrupt Status, offset: 0x228008 */
  __IO uint32_t CH21_SBR;                          /**< Channel System Bus, offset: 0x22800C */
  __IO uint32_t CH21_PRI;                          /**< Channel Priority, offset: 0x228010 */
       uint8_t RESERVED_21[12];
  __IO uint32_t TCD21_SADDR;                       /**< TCD Source Address, offset: 0x228020 */
  __IO uint16_t TCD21_SOFF;                        /**< TCD Signed Source Address Offset, offset: 0x228024 */
  __IO uint16_t TCD21_ATTR;                        /**< TCD Transfer Attributes, offset: 0x228026 */
  union {                                          /* offset: 0x228028 */
    __IO uint32_t TCD21_NBYTES_MLOFFNO;              /**< TCD Transfer Size Without Minor Loop Offsets, offset: 0x228028 */
    __IO uint32_t TCD21_NBYTES_MLOFFYES;             /**< TCD Transfer Size with Minor Loop Offsets, offset: 0x228028 */
  };
  __IO uint32_t TCD21_SLAST_SDA;                   /**< TCD Last Source Address Adjustment / Store DADDR Address, offset: 0x22802C */
  __IO uint32_t TCD21_DADDR;                       /**< TCD Destination Address, offset: 0x228030 */
  __IO uint16_t TCD21_DOFF;                        /**< TCD Signed Destination Address Offset, offset: 0x228034 */
  union {                                          /* offset: 0x228036 */
    __IO uint16_t TCD21_CITER_ELINKNO;               /**< TCD Current Major Loop Count (Minor Loop Channel Linking Disabled), offset: 0x228036 */
    __IO uint16_t TCD21_CITER_ELINKYES;              /**< TCD Current Major Loop Count (Minor Loop Channel Linking Enabled), offset: 0x228036 */
  };
  __IO uint32_t TCD21_DLAST_SGA;                   /**< TCD Last Destination Address Adjustment / Scatter Gather Address, offset: 0x228038 */
  __IO uint16_t TCD21_CSR;                         /**< TCD Control and Status, offset: 0x22803C */
  union {                                          /* offset: 0x22803E */
    __IO uint16_t TCD21_BITER_ELINKNO;               /**< TCD Beginning Major Loop Count (Minor Loop Channel Linking Disabled), offset: 0x22803E */
    __IO uint16_t TCD21_BITER_ELINKYES;              /**< TCD Beginning Major Loop Count (Minor Loop Channel Linking Enabled), offset: 0x22803E */
  };
       uint8_t RESERVED_22[16320];
  __IO uint32_t CH22_CSR;                          /**< Channel Control and Status, offset: 0x22C000 */
  __IO uint32_t CH22_ES;                           /**< Channel Error Status, offset: 0x22C004 */
  __IO uint32_t CH22_INT;                          /**< Channel Interrupt Status, offset: 0x22C008 */
  __IO uint32_t CH22_SBR;                          /**< Channel System Bus, offset: 0x22C00C */
  __IO uint32_t CH22_PRI;                          /**< Channel Priority, offset: 0x22C010 */
       uint8_t RESERVED_23[12];
  __IO uint32_t TCD22_SADDR;                       /**< TCD Source Address, offset: 0x22C020 */
  __IO uint16_t TCD22_SOFF;                        /**< TCD Signed Source Address Offset, offset: 0x22C024 */
  __IO uint16_t TCD22_ATTR;                        /**< TCD Transfer Attributes, offset: 0x22C026 */
  union {                                          /* offset: 0x22C028 */
    __IO uint32_t TCD22_NBYTES_MLOFFNO;              /**< TCD Transfer Size Without Minor Loop Offsets, offset: 0x22C028 */
    __IO uint32_t TCD22_NBYTES_MLOFFYES;             /**< TCD Transfer Size with Minor Loop Offsets, offset: 0x22C028 */
  };
  __IO uint32_t TCD22_SLAST_SDA;                   /**< TCD Last Source Address Adjustment / Store DADDR Address, offset: 0x22C02C */
  __IO uint32_t TCD22_DADDR;                       /**< TCD Destination Address, offset: 0x22C030 */
  __IO uint16_t TCD22_DOFF;                        /**< TCD Signed Destination Address Offset, offset: 0x22C034 */
  union {                                          /* offset: 0x22C036 */
    __IO uint16_t TCD22_CITER_ELINKNO;               /**< TCD Current Major Loop Count (Minor Loop Channel Linking Disabled), offset: 0x22C036 */
    __IO uint16_t TCD22_CITER_ELINKYES;              /**< TCD Current Major Loop Count (Minor Loop Channel Linking Enabled), offset: 0x22C036 */
  };
  __IO uint32_t TCD22_DLAST_SGA;                   /**< TCD Last Destination Address Adjustment / Scatter Gather Address, offset: 0x22C038 */
  __IO uint16_t TCD22_CSR;                         /**< TCD Control and Status, offset: 0x22C03C */
  union {                                          /* offset: 0x22C03E */
    __IO uint16_t TCD22_BITER_ELINKNO;               /**< TCD Beginning Major Loop Count (Minor Loop Channel Linking Disabled), offset: 0x22C03E */
    __IO uint16_t TCD22_BITER_ELINKYES;              /**< TCD Beginning Major Loop Count (Minor Loop Channel Linking Enabled), offset: 0x22C03E */
  };
       uint8_t RESERVED_24[16320];
  __IO uint32_t CH23_CSR;                          /**< Channel Control and Status, offset: 0x230000 */
  __IO uint32_t CH23_ES;                           /**< Channel Error Status, offset: 0x230004 */
  __IO uint32_t CH23_INT;                          /**< Channel Interrupt Status, offset: 0x230008 */
  __IO uint32_t CH23_SBR;                          /**< Channel System Bus, offset: 0x23000C */
  __IO uint32_t CH23_PRI;                          /**< Channel Priority, offset: 0x230010 */
       uint8_t RESERVED_25[12];
  __IO uint32_t TCD23_SADDR;                       /**< TCD Source Address, offset: 0x230020 */
  __IO uint16_t TCD23_SOFF;                        /**< TCD Signed Source Address Offset, offset: 0x230024 */
  __IO uint16_t TCD23_ATTR;                        /**< TCD Transfer Attributes, offset: 0x230026 */
  union {                                          /* offset: 0x230028 */
    __IO uint32_t TCD23_NBYTES_MLOFFNO;              /**< TCD Transfer Size Without Minor Loop Offsets, offset: 0x230028 */
    __IO uint32_t TCD23_NBYTES_MLOFFYES;             /**< TCD Transfer Size with Minor Loop Offsets, offset: 0x230028 */
  };
  __IO uint32_t TCD23_SLAST_SDA;                   /**< TCD Last Source Address Adjustment / Store DADDR Address, offset: 0x23002C */
  __IO uint32_t TCD23_DADDR;                       /**< TCD Destination Address, offset: 0x230030 */
  __IO uint16_t TCD23_DOFF;                        /**< TCD Signed Destination Address Offset, offset: 0x230034 */
  union {                                          /* offset: 0x230036 */
    __IO uint16_t TCD23_CITER_ELINKNO;               /**< TCD Current Major Loop Count (Minor Loop Channel Linking Disabled), offset: 0x230036 */
    __IO uint16_t TCD23_CITER_ELINKYES;              /**< TCD Current Major Loop Count (Minor Loop Channel Linking Enabled), offset: 0x230036 */
  };
  __IO uint32_t TCD23_DLAST_SGA;                   /**< TCD Last Destination Address Adjustment / Scatter Gather Address, offset: 0x230038 */
  __IO uint16_t TCD23_CSR;                         /**< TCD Control and Status, offset: 0x23003C */
  union {                                          /* offset: 0x23003E */
    __IO uint16_t TCD23_BITER_ELINKNO;               /**< TCD Beginning Major Loop Count (Minor Loop Channel Linking Disabled), offset: 0x23003E */
    __IO uint16_t TCD23_BITER_ELINKYES;              /**< TCD Beginning Major Loop Count (Minor Loop Channel Linking Enabled), offset: 0x23003E */
  };
       uint8_t RESERVED_26[16320];
  __IO uint32_t CH24_CSR;                          /**< Channel Control and Status, offset: 0x234000 */
  __IO uint32_t CH24_ES;                           /**< Channel Error Status, offset: 0x234004 */
  __IO uint32_t CH24_INT;                          /**< Channel Interrupt Status, offset: 0x234008 */
  __IO uint32_t CH24_SBR;                          /**< Channel System Bus, offset: 0x23400C */
  __IO uint32_t CH24_PRI;                          /**< Channel Priority, offset: 0x234010 */
       uint8_t RESERVED_27[12];
  __IO uint32_t TCD24_SADDR;                       /**< TCD Source Address, offset: 0x234020 */
  __IO uint16_t TCD24_SOFF;                        /**< TCD Signed Source Address Offset, offset: 0x234024 */
  __IO uint16_t TCD24_ATTR;                        /**< TCD Transfer Attributes, offset: 0x234026 */
  union {                                          /* offset: 0x234028 */
    __IO uint32_t TCD24_NBYTES_MLOFFNO;              /**< TCD Transfer Size Without Minor Loop Offsets, offset: 0x234028 */
    __IO uint32_t TCD24_NBYTES_MLOFFYES;             /**< TCD Transfer Size with Minor Loop Offsets, offset: 0x234028 */
  };
  __IO uint32_t TCD24_SLAST_SDA;                   /**< TCD Last Source Address Adjustment / Store DADDR Address, offset: 0x23402C */
  __IO uint32_t TCD24_DADDR;                       /**< TCD Destination Address, offset: 0x234030 */
  __IO uint16_t TCD24_DOFF;                        /**< TCD Signed Destination Address Offset, offset: 0x234034 */
  union {                                          /* offset: 0x234036 */
    __IO uint16_t TCD24_CITER_ELINKNO;               /**< TCD Current Major Loop Count (Minor Loop Channel Linking Disabled), offset: 0x234036 */
    __IO uint16_t TCD24_CITER_ELINKYES;              /**< TCD Current Major Loop Count (Minor Loop Channel Linking Enabled), offset: 0x234036 */
  };
  __IO uint32_t TCD24_DLAST_SGA;                   /**< TCD Last Destination Address Adjustment / Scatter Gather Address, offset: 0x234038 */
  __IO uint16_t TCD24_CSR;                         /**< TCD Control and Status, offset: 0x23403C */
  union {                                          /* offset: 0x23403E */
    __IO uint16_t TCD24_BITER_ELINKNO;               /**< TCD Beginning Major Loop Count (Minor Loop Channel Linking Disabled), offset: 0x23403E */
    __IO uint16_t TCD24_BITER_ELINKYES;              /**< TCD Beginning Major Loop Count (Minor Loop Channel Linking Enabled), offset: 0x23403E */
  };
       uint8_t RESERVED_28[16320];
  __IO uint32_t CH25_CSR;                          /**< Channel Control and Status, offset: 0x238000 */
  __IO uint32_t CH25_ES;                           /**< Channel Error Status, offset: 0x238004 */
  __IO uint32_t CH25_INT;                          /**< Channel Interrupt Status, offset: 0x238008 */
  __IO uint32_t CH25_SBR;                          /**< Channel System Bus, offset: 0x23800C */
  __IO uint32_t CH25_PRI;                          /**< Channel Priority, offset: 0x238010 */
       uint8_t RESERVED_29[12];
  __IO uint32_t TCD25_SADDR;                       /**< TCD Source Address, offset: 0x238020 */
  __IO uint16_t TCD25_SOFF;                        /**< TCD Signed Source Address Offset, offset: 0x238024 */
  __IO uint16_t TCD25_ATTR;                        /**< TCD Transfer Attributes, offset: 0x238026 */
  union {                                          /* offset: 0x238028 */
    __IO uint32_t TCD25_NBYTES_MLOFFNO;              /**< TCD Transfer Size Without Minor Loop Offsets, offset: 0x238028 */
    __IO uint32_t TCD25_NBYTES_MLOFFYES;             /**< TCD Transfer Size with Minor Loop Offsets, offset: 0x238028 */
  };
  __IO uint32_t TCD25_SLAST_SDA;                   /**< TCD Last Source Address Adjustment / Store DADDR Address, offset: 0x23802C */
  __IO uint32_t TCD25_DADDR;                       /**< TCD Destination Address, offset: 0x238030 */
  __IO uint16_t TCD25_DOFF;                        /**< TCD Signed Destination Address Offset, offset: 0x238034 */
  union {                                          /* offset: 0x238036 */
    __IO uint16_t TCD25_CITER_ELINKNO;               /**< TCD Current Major Loop Count (Minor Loop Channel Linking Disabled), offset: 0x238036 */
    __IO uint16_t TCD25_CITER_ELINKYES;              /**< TCD Current Major Loop Count (Minor Loop Channel Linking Enabled), offset: 0x238036 */
  };
  __IO uint32_t TCD25_DLAST_SGA;                   /**< TCD Last Destination Address Adjustment / Scatter Gather Address, offset: 0x238038 */
  __IO uint16_t TCD25_CSR;                         /**< TCD Control and Status, offset: 0x23803C */
  union {                                          /* offset: 0x23803E */
    __IO uint16_t TCD25_BITER_ELINKNO;               /**< TCD Beginning Major Loop Count (Minor Loop Channel Linking Disabled), offset: 0x23803E */
    __IO uint16_t TCD25_BITER_ELINKYES;              /**< TCD Beginning Major Loop Count (Minor Loop Channel Linking Enabled), offset: 0x23803E */
  };
       uint8_t RESERVED_30[16320];
  __IO uint32_t CH26_CSR;                          /**< Channel Control and Status, offset: 0x23C000 */
  __IO uint32_t CH26_ES;                           /**< Channel Error Status, offset: 0x23C004 */
  __IO uint32_t CH26_INT;                          /**< Channel Interrupt Status, offset: 0x23C008 */
  __IO uint32_t CH26_SBR;                          /**< Channel System Bus, offset: 0x23C00C */
  __IO uint32_t CH26_PRI;                          /**< Channel Priority, offset: 0x23C010 */
       uint8_t RESERVED_31[12];
  __IO uint32_t TCD26_SADDR;                       /**< TCD Source Address, offset: 0x23C020 */
  __IO uint16_t TCD26_SOFF;                        /**< TCD Signed Source Address Offset, offset: 0x23C024 */
  __IO uint16_t TCD26_ATTR;                        /**< TCD Transfer Attributes, offset: 0x23C026 */
  union {                                          /* offset: 0x23C028 */
    __IO uint32_t TCD26_NBYTES_MLOFFNO;              /**< TCD Transfer Size Without Minor Loop Offsets, offset: 0x23C028 */
    __IO uint32_t TCD26_NBYTES_MLOFFYES;             /**< TCD Transfer Size with Minor Loop Offsets, offset: 0x23C028 */
  };
  __IO uint32_t TCD26_SLAST_SDA;                   /**< TCD Last Source Address Adjustment / Store DADDR Address, offset: 0x23C02C */
  __IO uint32_t TCD26_DADDR;                       /**< TCD Destination Address, offset: 0x23C030 */
  __IO uint16_t TCD26_DOFF;                        /**< TCD Signed Destination Address Offset, offset: 0x23C034 */
  union {                                          /* offset: 0x23C036 */
    __IO uint16_t TCD26_CITER_ELINKNO;               /**< TCD Current Major Loop Count (Minor Loop Channel Linking Disabled), offset: 0x23C036 */
    __IO uint16_t TCD26_CITER_ELINKYES;              /**< TCD Current Major Loop Count (Minor Loop Channel Linking Enabled), offset: 0x23C036 */
  };
  __IO uint32_t TCD26_DLAST_SGA;                   /**< TCD Last Destination Address Adjustment / Scatter Gather Address, offset: 0x23C038 */
  __IO uint16_t TCD26_CSR;                         /**< TCD Control and Status, offset: 0x23C03C */
  union {                                          /* offset: 0x23C03E */
    __IO uint16_t TCD26_BITER_ELINKNO;               /**< TCD Beginning Major Loop Count (Minor Loop Channel Linking Disabled), offset: 0x23C03E */
    __IO uint16_t TCD26_BITER_ELINKYES;              /**< TCD Beginning Major Loop Count (Minor Loop Channel Linking Enabled), offset: 0x23C03E */
  };
       uint8_t RESERVED_32[16320];
  __IO uint32_t CH27_CSR;                          /**< Channel Control and Status, offset: 0x240000 */
  __IO uint32_t CH27_ES;                           /**< Channel Error Status, offset: 0x240004 */
  __IO uint32_t CH27_INT;                          /**< Channel Interrupt Status, offset: 0x240008 */
  __IO uint32_t CH27_SBR;                          /**< Channel System Bus, offset: 0x24000C */
  __IO uint32_t CH27_PRI;                          /**< Channel Priority, offset: 0x240010 */
       uint8_t RESERVED_33[12];
  __IO uint32_t TCD27_SADDR;                       /**< TCD Source Address, offset: 0x240020 */
  __IO uint16_t TCD27_SOFF;                        /**< TCD Signed Source Address Offset, offset: 0x240024 */
  __IO uint16_t TCD27_ATTR;                        /**< TCD Transfer Attributes, offset: 0x240026 */
  union {                                          /* offset: 0x240028 */
    __IO uint32_t TCD27_NBYTES_MLOFFNO;              /**< TCD Transfer Size Without Minor Loop Offsets, offset: 0x240028 */
    __IO uint32_t TCD27_NBYTES_MLOFFYES;             /**< TCD Transfer Size with Minor Loop Offsets, offset: 0x240028 */
  };
  __IO uint32_t TCD27_SLAST_SDA;                   /**< TCD Last Source Address Adjustment / Store DADDR Address, offset: 0x24002C */
  __IO uint32_t TCD27_DADDR;                       /**< TCD Destination Address, offset: 0x240030 */
  __IO uint16_t TCD27_DOFF;                        /**< TCD Signed Destination Address Offset, offset: 0x240034 */
  union {                                          /* offset: 0x240036 */
    __IO uint16_t TCD27_CITER_ELINKNO;               /**< TCD Current Major Loop Count (Minor Loop Channel Linking Disabled), offset: 0x240036 */
    __IO uint16_t TCD27_CITER_ELINKYES;              /**< TCD Current Major Loop Count (Minor Loop Channel Linking Enabled), offset: 0x240036 */
  };
  __IO uint32_t TCD27_DLAST_SGA;                   /**< TCD Last Destination Address Adjustment / Scatter Gather Address, offset: 0x240038 */
  __IO uint16_t TCD27_CSR;                         /**< TCD Control and Status, offset: 0x24003C */
  union {                                          /* offset: 0x24003E */
    __IO uint16_t TCD27_BITER_ELINKNO;               /**< TCD Beginning Major Loop Count (Minor Loop Channel Linking Disabled), offset: 0x24003E */
    __IO uint16_t TCD27_BITER_ELINKYES;              /**< TCD Beginning Major Loop Count (Minor Loop Channel Linking Enabled), offset: 0x24003E */
  };
       uint8_t RESERVED_34[16320];
  __IO uint32_t CH28_CSR;                          /**< Channel Control and Status, offset: 0x244000 */
  __IO uint32_t CH28_ES;                           /**< Channel Error Status, offset: 0x244004 */
  __IO uint32_t CH28_INT;                          /**< Channel Interrupt Status, offset: 0x244008 */
  __IO uint32_t CH28_SBR;                          /**< Channel System Bus, offset: 0x24400C */
  __IO uint32_t CH28_PRI;                          /**< Channel Priority, offset: 0x244010 */
       uint8_t RESERVED_35[12];
  __IO uint32_t TCD28_SADDR;                       /**< TCD Source Address, offset: 0x244020 */
  __IO uint16_t TCD28_SOFF;                        /**< TCD Signed Source Address Offset, offset: 0x244024 */
  __IO uint16_t TCD28_ATTR;                        /**< TCD Transfer Attributes, offset: 0x244026 */
  union {                                          /* offset: 0x244028 */
    __IO uint32_t TCD28_NBYTES_MLOFFNO;              /**< TCD Transfer Size Without Minor Loop Offsets, offset: 0x244028 */
