zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/MCX/MCXE/periph6/PERI_DMA.h
/*! @name TCD13_SLAST_SDA - TCD Last Source Address Adjustment / Store DADDR Address */
/*! @{ */

#define DMA_TCD13_SLAST_SDA_SLAST_SDA_MASK       (0xFFFFFFFFU)
#define DMA_TCD13_SLAST_SDA_SLAST_SDA_SHIFT      (0U)
/*! SLAST_SDA - Last Source Address Adjustment / Store DADDR Address */
#define DMA_TCD13_SLAST_SDA_SLAST_SDA(x)         (((uint32_t)(((uint32_t)(x)) << DMA_TCD13_SLAST_SDA_SLAST_SDA_SHIFT)) & DMA_TCD13_SLAST_SDA_SLAST_SDA_MASK)
/*! @} */

/*! @name TCD13_DADDR - TCD Destination Address */
/*! @{ */

#define DMA_TCD13_DADDR_DADDR_MASK               (0xFFFFFFFFU)
#define DMA_TCD13_DADDR_DADDR_SHIFT              (0U)
/*! DADDR - Destination Address */
#define DMA_TCD13_DADDR_DADDR(x)                 (((uint32_t)(((uint32_t)(x)) << DMA_TCD13_DADDR_DADDR_SHIFT)) & DMA_TCD13_DADDR_DADDR_MASK)
/*! @} */

/*! @name TCD13_DOFF - TCD Signed Destination Address Offset */
/*! @{ */

#define DMA_TCD13_DOFF_DOFF_MASK                 (0xFFFFU)
#define DMA_TCD13_DOFF_DOFF_SHIFT                (0U)
/*! DOFF - Destination Address Signed Offset */
#define DMA_TCD13_DOFF_DOFF(x)                   (((uint16_t)(((uint16_t)(x)) << DMA_TCD13_DOFF_DOFF_SHIFT)) & DMA_TCD13_DOFF_DOFF_MASK)
/*! @} */

/*! @name TCD13_CITER_ELINKNO - TCD Current Major Loop Count (Minor Loop Channel Linking Disabled) */
/*! @{ */

#define DMA_TCD13_CITER_ELINKNO_CITER_MASK       (0x7FFFU)
#define DMA_TCD13_CITER_ELINKNO_CITER_SHIFT      (0U)
/*! CITER - Current Major Iteration Count */
#define DMA_TCD13_CITER_ELINKNO_CITER(x)         (((uint16_t)(((uint16_t)(x)) << DMA_TCD13_CITER_ELINKNO_CITER_SHIFT)) & DMA_TCD13_CITER_ELINKNO_CITER_MASK)

#define DMA_TCD13_CITER_ELINKNO_ELINK_MASK       (0x8000U)
#define DMA_TCD13_CITER_ELINKNO_ELINK_SHIFT      (15U)
/*! ELINK - Enable Link
 *  0b0..Channel-to-channel linking disabled
 *  0b1..Channel-to-channel linking enabled
 */
#define DMA_TCD13_CITER_ELINKNO_ELINK(x)         (((uint16_t)(((uint16_t)(x)) << DMA_TCD13_CITER_ELINKNO_ELINK_SHIFT)) & DMA_TCD13_CITER_ELINKNO_ELINK_MASK)
/*! @} */

/*! @name TCD13_CITER_ELINKYES - TCD Current Major Loop Count (Minor Loop Channel Linking Enabled) */
/*! @{ */

#define DMA_TCD13_CITER_ELINKYES_CITER_MASK      (0x1FFU)
#define DMA_TCD13_CITER_ELINKYES_CITER_SHIFT     (0U)
/*! CITER - Current Major Iteration Count */
#define DMA_TCD13_CITER_ELINKYES_CITER(x)        (((uint16_t)(((uint16_t)(x)) << DMA_TCD13_CITER_ELINKYES_CITER_SHIFT)) & DMA_TCD13_CITER_ELINKYES_CITER_MASK)

#define DMA_TCD13_CITER_ELINKYES_LINKCH_MASK     (0x3E00U)
#define DMA_TCD13_CITER_ELINKYES_LINKCH_SHIFT    (9U)
/*! LINKCH - Minor Loop Link Channel Number */
#define DMA_TCD13_CITER_ELINKYES_LINKCH(x)       (((uint16_t)(((uint16_t)(x)) << DMA_TCD13_CITER_ELINKYES_LINKCH_SHIFT)) & DMA_TCD13_CITER_ELINKYES_LINKCH_MASK)

#define DMA_TCD13_CITER_ELINKYES_ELINK_MASK      (0x8000U)
#define DMA_TCD13_CITER_ELINKYES_ELINK_SHIFT     (15U)
/*! ELINK - Enable Link
 *  0b0..Channel-to-channel linking disabled
 *  0b1..Channel-to-channel linking enabled
 */
#define DMA_TCD13_CITER_ELINKYES_ELINK(x)        (((uint16_t)(((uint16_t)(x)) << DMA_TCD13_CITER_ELINKYES_ELINK_SHIFT)) & DMA_TCD13_CITER_ELINKYES_ELINK_MASK)
/*! @} */

/*! @name TCD13_DLAST_SGA - TCD Last Destination Address Adjustment / Scatter Gather Address */
/*! @{ */

#define DMA_TCD13_DLAST_SGA_DLAST_SGA_MASK       (0xFFFFFFFFU)
#define DMA_TCD13_DLAST_SGA_DLAST_SGA_SHIFT      (0U)
/*! DLAST_SGA - Last Destination Address Adjustment / Scatter Gather Address */
#define DMA_TCD13_DLAST_SGA_DLAST_SGA(x)         (((uint32_t)(((uint32_t)(x)) << DMA_TCD13_DLAST_SGA_DLAST_SGA_SHIFT)) & DMA_TCD13_DLAST_SGA_DLAST_SGA_MASK)
/*! @} */

/*! @name TCD13_CSR - TCD Control and Status */
/*! @{ */

#define DMA_TCD13_CSR_START_MASK                 (0x1U)
#define DMA_TCD13_CSR_START_SHIFT                (0U)
/*! START - Channel Start
 *  0b0..Channel not explicitly started
 *  0b1..Channel explicitly started via a software-initiated service request
 */
#define DMA_TCD13_CSR_START(x)                   (((uint16_t)(((uint16_t)(x)) << DMA_TCD13_CSR_START_SHIFT)) & DMA_TCD13_CSR_START_MASK)

#define DMA_TCD13_CSR_INTMAJOR_MASK              (0x2U)
#define DMA_TCD13_CSR_INTMAJOR_SHIFT             (1U)
/*! INTMAJOR - Enable Interrupt If Major count complete
 *  0b0..End-of-major loop interrupt disabled
 *  0b1..End-of-major loop interrupt enabled
 */
#define DMA_TCD13_CSR_INTMAJOR(x)                (((uint16_t)(((uint16_t)(x)) << DMA_TCD13_CSR_INTMAJOR_SHIFT)) & DMA_TCD13_CSR_INTMAJOR_MASK)

#define DMA_TCD13_CSR_INTHALF_MASK               (0x4U)
#define DMA_TCD13_CSR_INTHALF_SHIFT              (2U)
/*! INTHALF - Enable Interrupt If Major Counter Half-complete
 *  0b0..Halfway point interrupt disabled
 *  0b1..Halfway point interrupt enabled
 */
#define DMA_TCD13_CSR_INTHALF(x)                 (((uint16_t)(((uint16_t)(x)) << DMA_TCD13_CSR_INTHALF_SHIFT)) & DMA_TCD13_CSR_INTHALF_MASK)

#define DMA_TCD13_CSR_DREQ_MASK                  (0x8U)
#define DMA_TCD13_CSR_DREQ_SHIFT                 (3U)
/*! DREQ - Disable Request
 *  0b0..No operation
 *  0b1..Clear the ERQ field to 0 upon major loop completion, thus disabling hardware service requests
 */
#define DMA_TCD13_CSR_DREQ(x)                    (((uint16_t)(((uint16_t)(x)) << DMA_TCD13_CSR_DREQ_SHIFT)) & DMA_TCD13_CSR_DREQ_MASK)

#define DMA_TCD13_CSR_ESG_MASK                   (0x10U)
#define DMA_TCD13_CSR_ESG_SHIFT                  (4U)
/*! ESG - Enable Scatter/Gather Processing
 *  0b0..Current channel's TCD is normal format
 *  0b1..Current channel's TCD specifies scatter/gather format.
 */
#define DMA_TCD13_CSR_ESG(x)                     (((uint16_t)(((uint16_t)(x)) << DMA_TCD13_CSR_ESG_SHIFT)) & DMA_TCD13_CSR_ESG_MASK)

#define DMA_TCD13_CSR_MAJORELINK_MASK            (0x20U)
#define DMA_TCD13_CSR_MAJORELINK_SHIFT           (5U)
/*! MAJORELINK - Enable Link When Major Loop Complete
 *  0b0..Channel-to-channel linking disabled
 *  0b1..Channel-to-channel linking enabled
 */
#define DMA_TCD13_CSR_MAJORELINK(x)              (((uint16_t)(((uint16_t)(x)) << DMA_TCD13_CSR_MAJORELINK_SHIFT)) & DMA_TCD13_CSR_MAJORELINK_MASK)

#define DMA_TCD13_CSR_EEOP_MASK                  (0x40U)
#define DMA_TCD13_CSR_EEOP_SHIFT                 (6U)
/*! EEOP - Enable End-Of-Packet Processing
 *  0b0..End-of-packet operation disabled
 *  0b1..End-of-packet hardware input signal enabled
 */
#define DMA_TCD13_CSR_EEOP(x)                    (((uint16_t)(((uint16_t)(x)) << DMA_TCD13_CSR_EEOP_SHIFT)) & DMA_TCD13_CSR_EEOP_MASK)

