zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/MCX/MCXE/periph6/PERI_DMA.h
#define DMA_TCD13_CSR_ESDA_MASK                  (0x80U)
#define DMA_TCD13_CSR_ESDA_SHIFT                 (7U)
/*! ESDA - Enable Store Destination Address
 *  0b0..Ability to store destination address to system memory disabled
 *  0b1..Ability to store destination address to system memory enabled
 */
#define DMA_TCD13_CSR_ESDA(x)                    (((uint16_t)(((uint16_t)(x)) << DMA_TCD13_CSR_ESDA_SHIFT)) & DMA_TCD13_CSR_ESDA_MASK)

#define DMA_TCD13_CSR_MAJORLINKCH_MASK           (0x1F00U)
#define DMA_TCD13_CSR_MAJORLINKCH_SHIFT          (8U)
/*! MAJORLINKCH - Major Loop Link Channel Number */
#define DMA_TCD13_CSR_MAJORLINKCH(x)             (((uint16_t)(((uint16_t)(x)) << DMA_TCD13_CSR_MAJORLINKCH_SHIFT)) & DMA_TCD13_CSR_MAJORLINKCH_MASK)

#define DMA_TCD13_CSR_BWC_MASK                   (0xC000U)
#define DMA_TCD13_CSR_BWC_SHIFT                  (14U)
/*! BWC - Bandwidth Control
 *  0b00..No eDMA engine stalls
 *  0b01..Enable eDMA master high-priority elevation (HPE) mode. No eDMA engine stalls.
 *  0b10..eDMA engine stalls for 4 cycles after each R/W
 *  0b11..eDMA engine stalls for 8 cycles after each R/W
 */
#define DMA_TCD13_CSR_BWC(x)                     (((uint16_t)(((uint16_t)(x)) << DMA_TCD13_CSR_BWC_SHIFT)) & DMA_TCD13_CSR_BWC_MASK)
/*! @} */

/*! @name TCD13_BITER_ELINKNO - TCD Beginning Major Loop Count (Minor Loop Channel Linking Disabled) */
/*! @{ */

#define DMA_TCD13_BITER_ELINKNO_BITER_MASK       (0x7FFFU)
#define DMA_TCD13_BITER_ELINKNO_BITER_SHIFT      (0U)
/*! BITER - Starting Major Iteration Count */
#define DMA_TCD13_BITER_ELINKNO_BITER(x)         (((uint16_t)(((uint16_t)(x)) << DMA_TCD13_BITER_ELINKNO_BITER_SHIFT)) & DMA_TCD13_BITER_ELINKNO_BITER_MASK)

#define DMA_TCD13_BITER_ELINKNO_ELINK_MASK       (0x8000U)
#define DMA_TCD13_BITER_ELINKNO_ELINK_SHIFT      (15U)
/*! ELINK - Enables Link
 *  0b0..Channel-to-channel linking disabled
 *  0b1..Channel-to-channel linking enabled
 */
#define DMA_TCD13_BITER_ELINKNO_ELINK(x)         (((uint16_t)(((uint16_t)(x)) << DMA_TCD13_BITER_ELINKNO_ELINK_SHIFT)) & DMA_TCD13_BITER_ELINKNO_ELINK_MASK)
/*! @} */

/*! @name TCD13_BITER_ELINKYES - TCD Beginning Major Loop Count (Minor Loop Channel Linking Enabled) */
/*! @{ */

#define DMA_TCD13_BITER_ELINKYES_BITER_MASK      (0x1FFU)
#define DMA_TCD13_BITER_ELINKYES_BITER_SHIFT     (0U)
/*! BITER - Starting Major Iteration Count */
#define DMA_TCD13_BITER_ELINKYES_BITER(x)        (((uint16_t)(((uint16_t)(x)) << DMA_TCD13_BITER_ELINKYES_BITER_SHIFT)) & DMA_TCD13_BITER_ELINKYES_BITER_MASK)

#define DMA_TCD13_BITER_ELINKYES_LINKCH_MASK     (0x3E00U)
#define DMA_TCD13_BITER_ELINKYES_LINKCH_SHIFT    (9U)
/*! LINKCH - Link Channel Number */
#define DMA_TCD13_BITER_ELINKYES_LINKCH(x)       (((uint16_t)(((uint16_t)(x)) << DMA_TCD13_BITER_ELINKYES_LINKCH_SHIFT)) & DMA_TCD13_BITER_ELINKYES_LINKCH_MASK)

#define DMA_TCD13_BITER_ELINKYES_ELINK_MASK      (0x8000U)
#define DMA_TCD13_BITER_ELINKYES_ELINK_SHIFT     (15U)
/*! ELINK - Enable Link
 *  0b0..Channel-to-channel linking disabled
 *  0b1..Channel-to-channel linking enabled
 */
#define DMA_TCD13_BITER_ELINKYES_ELINK(x)        (((uint16_t)(((uint16_t)(x)) << DMA_TCD13_BITER_ELINKYES_ELINK_SHIFT)) & DMA_TCD13_BITER_ELINKYES_ELINK_MASK)
/*! @} */

/*! @name CH14_CSR - Channel Control and Status */
/*! @{ */

#define DMA_CH14_CSR_ERQ_MASK                    (0x1U)
#define DMA_CH14_CSR_ERQ_SHIFT                   (0U)
/*! ERQ - Enable DMA Request
 *  0b0..DMA hardware request signal for corresponding channel disabled
 *  0b1..DMA hardware request signal for corresponding channel enabled
 */
#define DMA_CH14_CSR_ERQ(x)                      (((uint32_t)(((uint32_t)(x)) << DMA_CH14_CSR_ERQ_SHIFT)) & DMA_CH14_CSR_ERQ_MASK)

#define DMA_CH14_CSR_EARQ_MASK                   (0x2U)
#define DMA_CH14_CSR_EARQ_SHIFT                  (1U)
/*! EARQ - Enable Asynchronous DMA Request In Stop Mode For Channel
 *  0b0..Disable asynchronous DMA request for the channel
 *  0b1..Enable asynchronous DMA request for the channel
 */
#define DMA_CH14_CSR_EARQ(x)                     (((uint32_t)(((uint32_t)(x)) << DMA_CH14_CSR_EARQ_SHIFT)) & DMA_CH14_CSR_EARQ_MASK)

#define DMA_CH14_CSR_EEI_MASK                    (0x4U)
#define DMA_CH14_CSR_EEI_SHIFT                   (2U)
/*! EEI - Enable Error Interrupt
 *  0b0..Error signal for corresponding channel does not generate error interrupt
 *  0b1..Assertion of error signal for corresponding channel generates error interrupt request
 */
#define DMA_CH14_CSR_EEI(x)                      (((uint32_t)(((uint32_t)(x)) << DMA_CH14_CSR_EEI_SHIFT)) & DMA_CH14_CSR_EEI_MASK)

#define DMA_CH14_CSR_EBW_MASK                    (0x8U)
#define DMA_CH14_CSR_EBW_SHIFT                   (3U)
/*! EBW - Enable Buffered Writes
 *  0b0..Buffered writes on system bus disabled
 *  0b1..Buffered writes on system bus enabled
 */
#define DMA_CH14_CSR_EBW(x)                      (((uint32_t)(((uint32_t)(x)) << DMA_CH14_CSR_EBW_SHIFT)) & DMA_CH14_CSR_EBW_MASK)

#define DMA_CH14_CSR_DONE_MASK                   (0x40000000U)
#define DMA_CH14_CSR_DONE_SHIFT                  (30U)
/*! DONE - Channel Done */
#define DMA_CH14_CSR_DONE(x)                     (((uint32_t)(((uint32_t)(x)) << DMA_CH14_CSR_DONE_SHIFT)) & DMA_CH14_CSR_DONE_MASK)

#define DMA_CH14_CSR_ACTIVE_MASK                 (0x80000000U)
#define DMA_CH14_CSR_ACTIVE_SHIFT                (31U)
/*! ACTIVE - Channel Active */
#define DMA_CH14_CSR_ACTIVE(x)                   (((uint32_t)(((uint32_t)(x)) << DMA_CH14_CSR_ACTIVE_SHIFT)) & DMA_CH14_CSR_ACTIVE_MASK)
/*! @} */

/*! @name CH14_ES - Channel Error Status */
/*! @{ */

#define DMA_CH14_ES_DBE_MASK                     (0x1U)
#define DMA_CH14_ES_DBE_SHIFT                    (0U)
/*! DBE - Destination Bus Error
 *  0b0..No destination bus error
 *  0b1..Last recorded error was bus error on destination write
 */
#define DMA_CH14_ES_DBE(x)                       (((uint32_t)(((uint32_t)(x)) << DMA_CH14_ES_DBE_SHIFT)) & DMA_CH14_ES_DBE_MASK)

#define DMA_CH14_ES_SBE_MASK                     (0x2U)
#define DMA_CH14_ES_SBE_SHIFT                    (1U)
/*! SBE - Source Bus Error
 *  0b0..No source bus error
 *  0b1..Last recorded error was bus error on source read
 */
#define DMA_CH14_ES_SBE(x)                       (((uint32_t)(((uint32_t)(x)) << DMA_CH14_ES_SBE_SHIFT)) & DMA_CH14_ES_SBE_MASK)

#define DMA_CH14_ES_SGE_MASK                     (0x4U)
#define DMA_CH14_ES_SGE_SHIFT                    (2U)
/*! SGE - Scatter/Gather Configuration Error
 *  0b0..No scatter/gather configuration error
 *  0b1..Last recorded error was a configuration error detected in the TCDn_DLAST_SGA field
 */
#define DMA_CH14_ES_SGE(x)                       (((uint32_t)(((uint32_t)(x)) << DMA_CH14_ES_SGE_SHIFT)) & DMA_CH14_ES_SGE_MASK)

#define DMA_CH14_ES_NCE_MASK                     (0x8U)
#define DMA_CH14_ES_NCE_SHIFT                    (3U)
/*! NCE - NBYTES/CITER Configuration Error
 *  0b0..No NBYTES/CITER configuration error
 *  0b1..Last recorded error was a configuration error detected in the TCDn_NBYTES or TCDn_CITER fields
 */
#define DMA_CH14_ES_NCE(x)                       (((uint32_t)(((uint32_t)(x)) << DMA_CH14_ES_NCE_SHIFT)) & DMA_CH14_ES_NCE_MASK)

#define DMA_CH14_ES_DOE_MASK                     (0x10U)
#define DMA_CH14_ES_DOE_SHIFT                    (4U)
/*! DOE - Destination Offset Error
 *  0b0..No destination offset configuration error
 *  0b1..Last recorded error was a configuration error detected in the TCDn_DOFF field
 */
#define DMA_CH14_ES_DOE(x)                       (((uint32_t)(((uint32_t)(x)) << DMA_CH14_ES_DOE_SHIFT)) & DMA_CH14_ES_DOE_MASK)

#define DMA_CH14_ES_DAE_MASK                     (0x20U)
#define DMA_CH14_ES_DAE_SHIFT                    (5U)
/*! DAE - Destination Address Error
 *  0b0..No destination address configuration error
 *  0b1..Last recorded error was a configuration error detected in the TCDn_DADDR field
 */
#define DMA_CH14_ES_DAE(x)                       (((uint32_t)(((uint32_t)(x)) << DMA_CH14_ES_DAE_SHIFT)) & DMA_CH14_ES_DAE_MASK)

