zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/MCX/MCXE/periph6/PERI_DMA.h
/*! @name TCD20_DADDR - TCD Destination Address */
/*! @{ */

#define DMA_TCD20_DADDR_DADDR_MASK               (0xFFFFFFFFU)
#define DMA_TCD20_DADDR_DADDR_SHIFT              (0U)
/*! DADDR - Destination Address */
#define DMA_TCD20_DADDR_DADDR(x)                 (((uint32_t)(((uint32_t)(x)) << DMA_TCD20_DADDR_DADDR_SHIFT)) & DMA_TCD20_DADDR_DADDR_MASK)
/*! @} */

/*! @name TCD20_DOFF - TCD Signed Destination Address Offset */
/*! @{ */

#define DMA_TCD20_DOFF_DOFF_MASK                 (0xFFFFU)
#define DMA_TCD20_DOFF_DOFF_SHIFT                (0U)
/*! DOFF - Destination Address Signed Offset */
#define DMA_TCD20_DOFF_DOFF(x)                   (((uint16_t)(((uint16_t)(x)) << DMA_TCD20_DOFF_DOFF_SHIFT)) & DMA_TCD20_DOFF_DOFF_MASK)
/*! @} */

/*! @name TCD20_CITER_ELINKNO - TCD Current Major Loop Count (Minor Loop Channel Linking Disabled) */
/*! @{ */

#define DMA_TCD20_CITER_ELINKNO_CITER_MASK       (0x7FFFU)
#define DMA_TCD20_CITER_ELINKNO_CITER_SHIFT      (0U)
/*! CITER - Current Major Iteration Count */
#define DMA_TCD20_CITER_ELINKNO_CITER(x)         (((uint16_t)(((uint16_t)(x)) << DMA_TCD20_CITER_ELINKNO_CITER_SHIFT)) & DMA_TCD20_CITER_ELINKNO_CITER_MASK)

#define DMA_TCD20_CITER_ELINKNO_ELINK_MASK       (0x8000U)
#define DMA_TCD20_CITER_ELINKNO_ELINK_SHIFT      (15U)
/*! ELINK - Enable Link
 *  0b0..Channel-to-channel linking disabled
 *  0b1..Channel-to-channel linking enabled
 */
#define DMA_TCD20_CITER_ELINKNO_ELINK(x)         (((uint16_t)(((uint16_t)(x)) << DMA_TCD20_CITER_ELINKNO_ELINK_SHIFT)) & DMA_TCD20_CITER_ELINKNO_ELINK_MASK)
/*! @} */

/*! @name TCD20_CITER_ELINKYES - TCD Current Major Loop Count (Minor Loop Channel Linking Enabled) */
/*! @{ */

#define DMA_TCD20_CITER_ELINKYES_CITER_MASK      (0x1FFU)
#define DMA_TCD20_CITER_ELINKYES_CITER_SHIFT     (0U)
/*! CITER - Current Major Iteration Count */
#define DMA_TCD20_CITER_ELINKYES_CITER(x)        (((uint16_t)(((uint16_t)(x)) << DMA_TCD20_CITER_ELINKYES_CITER_SHIFT)) & DMA_TCD20_CITER_ELINKYES_CITER_MASK)

#define DMA_TCD20_CITER_ELINKYES_LINKCH_MASK     (0x3E00U)
#define DMA_TCD20_CITER_ELINKYES_LINKCH_SHIFT    (9U)
/*! LINKCH - Minor Loop Link Channel Number */
#define DMA_TCD20_CITER_ELINKYES_LINKCH(x)       (((uint16_t)(((uint16_t)(x)) << DMA_TCD20_CITER_ELINKYES_LINKCH_SHIFT)) & DMA_TCD20_CITER_ELINKYES_LINKCH_MASK)

#define DMA_TCD20_CITER_ELINKYES_ELINK_MASK      (0x8000U)
#define DMA_TCD20_CITER_ELINKYES_ELINK_SHIFT     (15U)
/*! ELINK - Enable Link
 *  0b0..Channel-to-channel linking disabled
 *  0b1..Channel-to-channel linking enabled
 */
#define DMA_TCD20_CITER_ELINKYES_ELINK(x)        (((uint16_t)(((uint16_t)(x)) << DMA_TCD20_CITER_ELINKYES_ELINK_SHIFT)) & DMA_TCD20_CITER_ELINKYES_ELINK_MASK)
/*! @} */

/*! @name TCD20_DLAST_SGA - TCD Last Destination Address Adjustment / Scatter Gather Address */
/*! @{ */

#define DMA_TCD20_DLAST_SGA_DLAST_SGA_MASK       (0xFFFFFFFFU)
#define DMA_TCD20_DLAST_SGA_DLAST_SGA_SHIFT      (0U)
/*! DLAST_SGA - Last Destination Address Adjustment / Scatter Gather Address */
#define DMA_TCD20_DLAST_SGA_DLAST_SGA(x)         (((uint32_t)(((uint32_t)(x)) << DMA_TCD20_DLAST_SGA_DLAST_SGA_SHIFT)) & DMA_TCD20_DLAST_SGA_DLAST_SGA_MASK)
/*! @} */

/*! @name TCD20_CSR - TCD Control and Status */
/*! @{ */

#define DMA_TCD20_CSR_START_MASK                 (0x1U)
#define DMA_TCD20_CSR_START_SHIFT                (0U)
/*! START - Channel Start
 *  0b0..Channel not explicitly started
 *  0b1..Channel explicitly started via a software-initiated service request
 */
#define DMA_TCD20_CSR_START(x)                   (((uint16_t)(((uint16_t)(x)) << DMA_TCD20_CSR_START_SHIFT)) & DMA_TCD20_CSR_START_MASK)

#define DMA_TCD20_CSR_INTMAJOR_MASK              (0x2U)
#define DMA_TCD20_CSR_INTMAJOR_SHIFT             (1U)
/*! INTMAJOR - Enable Interrupt If Major count complete
 *  0b0..End-of-major loop interrupt disabled
 *  0b1..End-of-major loop interrupt enabled
 */
#define DMA_TCD20_CSR_INTMAJOR(x)                (((uint16_t)(((uint16_t)(x)) << DMA_TCD20_CSR_INTMAJOR_SHIFT)) & DMA_TCD20_CSR_INTMAJOR_MASK)

#define DMA_TCD20_CSR_INTHALF_MASK               (0x4U)
#define DMA_TCD20_CSR_INTHALF_SHIFT              (2U)
/*! INTHALF - Enable Interrupt If Major Counter Half-complete
 *  0b0..Halfway point interrupt disabled
 *  0b1..Halfway point interrupt enabled
 */
#define DMA_TCD20_CSR_INTHALF(x)                 (((uint16_t)(((uint16_t)(x)) << DMA_TCD20_CSR_INTHALF_SHIFT)) & DMA_TCD20_CSR_INTHALF_MASK)

#define DMA_TCD20_CSR_DREQ_MASK                  (0x8U)
#define DMA_TCD20_CSR_DREQ_SHIFT                 (3U)
/*! DREQ - Disable Request
 *  0b0..No operation
 *  0b1..Clear the ERQ field to 0 upon major loop completion, thus disabling hardware service requests
 */
#define DMA_TCD20_CSR_DREQ(x)                    (((uint16_t)(((uint16_t)(x)) << DMA_TCD20_CSR_DREQ_SHIFT)) & DMA_TCD20_CSR_DREQ_MASK)

#define DMA_TCD20_CSR_ESG_MASK                   (0x10U)
#define DMA_TCD20_CSR_ESG_SHIFT                  (4U)
/*! ESG - Enable Scatter/Gather Processing
 *  0b0..Current channel's TCD is normal format
 *  0b1..Current channel's TCD specifies scatter/gather format.
 */
#define DMA_TCD20_CSR_ESG(x)                     (((uint16_t)(((uint16_t)(x)) << DMA_TCD20_CSR_ESG_SHIFT)) & DMA_TCD20_CSR_ESG_MASK)

#define DMA_TCD20_CSR_MAJORELINK_MASK            (0x20U)
#define DMA_TCD20_CSR_MAJORELINK_SHIFT           (5U)
/*! MAJORELINK - Enable Link When Major Loop Complete
 *  0b0..Channel-to-channel linking disabled
 *  0b1..Channel-to-channel linking enabled
 */
#define DMA_TCD20_CSR_MAJORELINK(x)              (((uint16_t)(((uint16_t)(x)) << DMA_TCD20_CSR_MAJORELINK_SHIFT)) & DMA_TCD20_CSR_MAJORELINK_MASK)

#define DMA_TCD20_CSR_EEOP_MASK                  (0x40U)
#define DMA_TCD20_CSR_EEOP_SHIFT                 (6U)
/*! EEOP - Enable End-Of-Packet Processing
 *  0b0..End-of-packet operation disabled
 *  0b1..End-of-packet hardware input signal enabled
 */
#define DMA_TCD20_CSR_EEOP(x)                    (((uint16_t)(((uint16_t)(x)) << DMA_TCD20_CSR_EEOP_SHIFT)) & DMA_TCD20_CSR_EEOP_MASK)

#define DMA_TCD20_CSR_ESDA_MASK                  (0x80U)
#define DMA_TCD20_CSR_ESDA_SHIFT                 (7U)
/*! ESDA - Enable Store Destination Address
 *  0b0..Ability to store destination address to system memory disabled
 *  0b1..Ability to store destination address to system memory enabled
 */
#define DMA_TCD20_CSR_ESDA(x)                    (((uint16_t)(((uint16_t)(x)) << DMA_TCD20_CSR_ESDA_SHIFT)) & DMA_TCD20_CSR_ESDA_MASK)

#define DMA_TCD20_CSR_MAJORLINKCH_MASK           (0x1F00U)
#define DMA_TCD20_CSR_MAJORLINKCH_SHIFT          (8U)
/*! MAJORLINKCH - Major Loop Link Channel Number */
#define DMA_TCD20_CSR_MAJORLINKCH(x)             (((uint16_t)(((uint16_t)(x)) << DMA_TCD20_CSR_MAJORLINKCH_SHIFT)) & DMA_TCD20_CSR_MAJORLINKCH_MASK)

#define DMA_TCD20_CSR_BWC_MASK                   (0xC000U)
#define DMA_TCD20_CSR_BWC_SHIFT                  (14U)
/*! BWC - Bandwidth Control
 *  0b00..No eDMA engine stalls
 *  0b01..Enable eDMA master high-priority elevation (HPE) mode. No eDMA engine stalls.
 *  0b10..eDMA engine stalls for 4 cycles after each R/W
 *  0b11..eDMA engine stalls for 8 cycles after each R/W
 */
#define DMA_TCD20_CSR_BWC(x)                     (((uint16_t)(((uint16_t)(x)) << DMA_TCD20_CSR_BWC_SHIFT)) & DMA_TCD20_CSR_BWC_MASK)
/*! @} */

/*! @name TCD20_BITER_ELINKNO - TCD Beginning Major Loop Count (Minor Loop Channel Linking Disabled) */
/*! @{ */

#define DMA_TCD20_BITER_ELINKNO_BITER_MASK       (0x7FFFU)
#define DMA_TCD20_BITER_ELINKNO_BITER_SHIFT      (0U)
/*! BITER - Starting Major Iteration Count */
#define DMA_TCD20_BITER_ELINKNO_BITER(x)         (((uint16_t)(((uint16_t)(x)) << DMA_TCD20_BITER_ELINKNO_BITER_SHIFT)) & DMA_TCD20_BITER_ELINKNO_BITER_MASK)

#define DMA_TCD20_BITER_ELINKNO_ELINK_MASK       (0x8000U)
#define DMA_TCD20_BITER_ELINKNO_ELINK_SHIFT      (15U)
/*! ELINK - Enables Link
 *  0b0..Channel-to-channel linking disabled
 *  0b1..Channel-to-channel linking enabled
 */
#define DMA_TCD20_BITER_ELINKNO_ELINK(x)         (((uint16_t)(((uint16_t)(x)) << DMA_TCD20_BITER_ELINKNO_ELINK_SHIFT)) & DMA_TCD20_BITER_ELINKNO_ELINK_MASK)
/*! @} */

/*! @name TCD20_BITER_ELINKYES - TCD Beginning Major Loop Count (Minor Loop Channel Linking Enabled) */
/*! @{ */

#define DMA_TCD20_BITER_ELINKYES_BITER_MASK      (0x1FFU)
#define DMA_TCD20_BITER_ELINKYES_BITER_SHIFT     (0U)
/*! BITER - Starting Major Iteration Count */
#define DMA_TCD20_BITER_ELINKYES_BITER(x)        (((uint16_t)(((uint16_t)(x)) << DMA_TCD20_BITER_ELINKYES_BITER_SHIFT)) & DMA_TCD20_BITER_ELINKYES_BITER_MASK)

#define DMA_TCD20_BITER_ELINKYES_LINKCH_MASK     (0x3E00U)
#define DMA_TCD20_BITER_ELINKYES_LINKCH_SHIFT    (9U)
/*! LINKCH - Link Channel Number */
#define DMA_TCD20_BITER_ELINKYES_LINKCH(x)       (((uint16_t)(((uint16_t)(x)) << DMA_TCD20_BITER_ELINKYES_LINKCH_SHIFT)) & DMA_TCD20_BITER_ELINKYES_LINKCH_MASK)

#define DMA_TCD20_BITER_ELINKYES_ELINK_MASK      (0x8000U)
#define DMA_TCD20_BITER_ELINKYES_ELINK_SHIFT     (15U)
/*! ELINK - Enable Link
 *  0b0..Channel-to-channel linking disabled
 *  0b1..Channel-to-channel linking enabled
 */
#define DMA_TCD20_BITER_ELINKYES_ELINK(x)        (((uint16_t)(((uint16_t)(x)) << DMA_TCD20_BITER_ELINKYES_ELINK_SHIFT)) & DMA_TCD20_BITER_ELINKYES_ELINK_MASK)
/*! @} */

/*! @name CH21_CSR - Channel Control and Status */
/*! @{ */

#define DMA_CH21_CSR_ERQ_MASK                    (0x1U)
#define DMA_CH21_CSR_ERQ_SHIFT                   (0U)
/*! ERQ - Enable DMA Request
 *  0b0..DMA hardware request signal for corresponding channel disabled
 *  0b1..DMA hardware request signal for corresponding channel enabled
 */
#define DMA_CH21_CSR_ERQ(x)                      (((uint32_t)(((uint32_t)(x)) << DMA_CH21_CSR_ERQ_SHIFT)) & DMA_CH21_CSR_ERQ_MASK)

#define DMA_CH21_CSR_EARQ_MASK                   (0x2U)
#define DMA_CH21_CSR_EARQ_SHIFT                  (1U)
/*! EARQ - Enable Asynchronous DMA Request In Stop Mode For Channel
 *  0b0..Disable asynchronous DMA request for the channel
 *  0b1..Enable asynchronous DMA request for the channel
 */
#define DMA_CH21_CSR_EARQ(x)                     (((uint32_t)(((uint32_t)(x)) << DMA_CH21_CSR_EARQ_SHIFT)) & DMA_CH21_CSR_EARQ_MASK)

#define DMA_CH21_CSR_EEI_MASK                    (0x4U)
#define DMA_CH21_CSR_EEI_SHIFT                   (2U)
/*! EEI - Enable Error Interrupt
 *  0b0..Error signal for corresponding channel does not generate error interrupt
 *  0b1..Assertion of error signal for corresponding channel generates error interrupt request
 */
#define DMA_CH21_CSR_EEI(x)                      (((uint32_t)(((uint32_t)(x)) << DMA_CH21_CSR_EEI_SHIFT)) & DMA_CH21_CSR_EEI_MASK)

#define DMA_CH21_CSR_EBW_MASK                    (0x8U)
#define DMA_CH21_CSR_EBW_SHIFT                   (3U)
/*! EBW - Enable Buffered Writes
 *  0b0..Buffered writes on system bus disabled
 *  0b1..Buffered writes on system bus enabled
 */
#define DMA_CH21_CSR_EBW(x)                      (((uint32_t)(((uint32_t)(x)) << DMA_CH21_CSR_EBW_SHIFT)) & DMA_CH21_CSR_EBW_MASK)

#define DMA_CH21_CSR_DONE_MASK                   (0x40000000U)
#define DMA_CH21_CSR_DONE_SHIFT                  (30U)
/*! DONE - Channel Done */
#define DMA_CH21_CSR_DONE(x)                     (((uint32_t)(((uint32_t)(x)) << DMA_CH21_CSR_DONE_SHIFT)) & DMA_CH21_CSR_DONE_MASK)

#define DMA_CH21_CSR_ACTIVE_MASK                 (0x80000000U)
#define DMA_CH21_CSR_ACTIVE_SHIFT                (31U)
/*! ACTIVE - Channel Active */
#define DMA_CH21_CSR_ACTIVE(x)                   (((uint32_t)(((uint32_t)(x)) << DMA_CH21_CSR_ACTIVE_SHIFT)) & DMA_CH21_CSR_ACTIVE_MASK)
/*! @} */

/*! @name CH21_ES - Channel Error Status */
/*! @{ */

