zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/MCX/MCXE/periph6/PERI_DMA.h
#define DMA_CH24_ES_DBE_MASK                     (0x1U)
#define DMA_CH24_ES_DBE_SHIFT                    (0U)
/*! DBE - Destination Bus Error
 *  0b0..No destination bus error
 *  0b1..Last recorded error was bus error on destination write
 */
#define DMA_CH24_ES_DBE(x)                       (((uint32_t)(((uint32_t)(x)) << DMA_CH24_ES_DBE_SHIFT)) & DMA_CH24_ES_DBE_MASK)

#define DMA_CH24_ES_SBE_MASK                     (0x2U)
#define DMA_CH24_ES_SBE_SHIFT                    (1U)
/*! SBE - Source Bus Error
 *  0b0..No source bus error
 *  0b1..Last recorded error was bus error on source read
 */
#define DMA_CH24_ES_SBE(x)                       (((uint32_t)(((uint32_t)(x)) << DMA_CH24_ES_SBE_SHIFT)) & DMA_CH24_ES_SBE_MASK)

#define DMA_CH24_ES_SGE_MASK                     (0x4U)
#define DMA_CH24_ES_SGE_SHIFT                    (2U)
/*! SGE - Scatter/Gather Configuration Error
 *  0b0..No scatter/gather configuration error
 *  0b1..Last recorded error was a configuration error detected in the TCDn_DLAST_SGA field
 */
#define DMA_CH24_ES_SGE(x)                       (((uint32_t)(((uint32_t)(x)) << DMA_CH24_ES_SGE_SHIFT)) & DMA_CH24_ES_SGE_MASK)

#define DMA_CH24_ES_NCE_MASK                     (0x8U)
#define DMA_CH24_ES_NCE_SHIFT                    (3U)
/*! NCE - NBYTES/CITER Configuration Error
 *  0b0..No NBYTES/CITER configuration error
 *  0b1..Last recorded error was a configuration error detected in the TCDn_NBYTES or TCDn_CITER fields
 */
#define DMA_CH24_ES_NCE(x)                       (((uint32_t)(((uint32_t)(x)) << DMA_CH24_ES_NCE_SHIFT)) & DMA_CH24_ES_NCE_MASK)

#define DMA_CH24_ES_DOE_MASK                     (0x10U)
#define DMA_CH24_ES_DOE_SHIFT                    (4U)
/*! DOE - Destination Offset Error
 *  0b0..No destination offset configuration error
 *  0b1..Last recorded error was a configuration error detected in the TCDn_DOFF field
 */
#define DMA_CH24_ES_DOE(x)                       (((uint32_t)(((uint32_t)(x)) << DMA_CH24_ES_DOE_SHIFT)) & DMA_CH24_ES_DOE_MASK)

#define DMA_CH24_ES_DAE_MASK                     (0x20U)
#define DMA_CH24_ES_DAE_SHIFT                    (5U)
/*! DAE - Destination Address Error
 *  0b0..No destination address configuration error
 *  0b1..Last recorded error was a configuration error detected in the TCDn_DADDR field
 */
#define DMA_CH24_ES_DAE(x)                       (((uint32_t)(((uint32_t)(x)) << DMA_CH24_ES_DAE_SHIFT)) & DMA_CH24_ES_DAE_MASK)

#define DMA_CH24_ES_SOE_MASK                     (0x40U)
#define DMA_CH24_ES_SOE_SHIFT                    (6U)
/*! SOE - Source Offset Error
 *  0b0..No source offset configuration error
 *  0b1..Last recorded error was a configuration error detected in the TCDn_SOFF field
 */
#define DMA_CH24_ES_SOE(x)                       (((uint32_t)(((uint32_t)(x)) << DMA_CH24_ES_SOE_SHIFT)) & DMA_CH24_ES_SOE_MASK)

#define DMA_CH24_ES_SAE_MASK                     (0x80U)
#define DMA_CH24_ES_SAE_SHIFT                    (7U)
/*! SAE - Source Address Error
 *  0b0..No source address configuration error
 *  0b1..Last recorded error was a configuration error detected in the TCDn_SADDR field
 */
#define DMA_CH24_ES_SAE(x)                       (((uint32_t)(((uint32_t)(x)) << DMA_CH24_ES_SAE_SHIFT)) & DMA_CH24_ES_SAE_MASK)

#define DMA_CH24_ES_ERR_MASK                     (0x80000000U)
#define DMA_CH24_ES_ERR_SHIFT                    (31U)
/*! ERR - Error In Channel
 *  0b0..An error in this channel has not occurred
 *  0b1..An error in this channel has occurred
 */
#define DMA_CH24_ES_ERR(x)                       (((uint32_t)(((uint32_t)(x)) << DMA_CH24_ES_ERR_SHIFT)) & DMA_CH24_ES_ERR_MASK)
/*! @} */

/*! @name CH24_INT - Channel Interrupt Status */
/*! @{ */

#define DMA_CH24_INT_INT_MASK                    (0x1U)
#define DMA_CH24_INT_INT_SHIFT                   (0U)
/*! INT - Interrupt Request
 *  0b0..Interrupt request for corresponding channel cleared
 *  0b1..Interrupt request for corresponding channel active
 */
#define DMA_CH24_INT_INT(x)                      (((uint32_t)(((uint32_t)(x)) << DMA_CH24_INT_INT_SHIFT)) & DMA_CH24_INT_INT_MASK)
/*! @} */

/*! @name CH24_SBR - Channel System Bus */
/*! @{ */

#define DMA_CH24_SBR_MID_MASK                    (0xFU)
#define DMA_CH24_SBR_MID_SHIFT                   (0U)
/*! MID - Master ID */
#define DMA_CH24_SBR_MID(x)                      (((uint32_t)(((uint32_t)(x)) << DMA_CH24_SBR_MID_SHIFT)) & DMA_CH24_SBR_MID_MASK)

#define DMA_CH24_SBR_PAL_MASK                    (0x8000U)
#define DMA_CH24_SBR_PAL_SHIFT                   (15U)
/*! PAL - Privileged Access Level
 *  0b0..User protection level for DMA transfers
 *  0b1..Privileged protection level for DMA transfers
 */
#define DMA_CH24_SBR_PAL(x)                      (((uint32_t)(((uint32_t)(x)) << DMA_CH24_SBR_PAL_SHIFT)) & DMA_CH24_SBR_PAL_MASK)

#define DMA_CH24_SBR_EMI_MASK                    (0x10000U)
#define DMA_CH24_SBR_EMI_SHIFT                   (16U)
/*! EMI - Enable Master ID Replication
 *  0b0..Master ID replication is disabled
 *  0b1..Master ID replication is enabled
 */
#define DMA_CH24_SBR_EMI(x)                      (((uint32_t)(((uint32_t)(x)) << DMA_CH24_SBR_EMI_SHIFT)) & DMA_CH24_SBR_EMI_MASK)

#define DMA_CH24_SBR_ATTR_MASK                   (0xE0000U)
#define DMA_CH24_SBR_ATTR_SHIFT                  (17U)
/*! ATTR - Attribute Output */
#define DMA_CH24_SBR_ATTR(x)                     (((uint32_t)(((uint32_t)(x)) << DMA_CH24_SBR_ATTR_SHIFT)) & DMA_CH24_SBR_ATTR_MASK)
/*! @} */

/*! @name CH24_PRI - Channel Priority */
/*! @{ */

#define DMA_CH24_PRI_APL_MASK                    (0x7U)
#define DMA_CH24_PRI_APL_SHIFT                   (0U)
/*! APL - Arbitration Priority Level */
#define DMA_CH24_PRI_APL(x)                      (((uint32_t)(((uint32_t)(x)) << DMA_CH24_PRI_APL_SHIFT)) & DMA_CH24_PRI_APL_MASK)

#define DMA_CH24_PRI_DPA_MASK                    (0x40000000U)
#define DMA_CH24_PRI_DPA_SHIFT                   (30U)
/*! DPA - Disable Preempt Ability
 *  0b0..Channel can suspend a lower-priority channel
 *  0b1..Channel cannot suspend any other channel, regardless of channel priority
 */
#define DMA_CH24_PRI_DPA(x)                      (((uint32_t)(((uint32_t)(x)) << DMA_CH24_PRI_DPA_SHIFT)) & DMA_CH24_PRI_DPA_MASK)

#define DMA_CH24_PRI_ECP_MASK                    (0x80000000U)
#define DMA_CH24_PRI_ECP_SHIFT                   (31U)
/*! ECP - Enable Channel Preemption
 *  0b0..Channel cannot be suspended by a higher-priority channel's service request
 *  0b1..Channel can be temporarily suspended by a higher-priority channel's service request
 */
#define DMA_CH24_PRI_ECP(x)                      (((uint32_t)(((uint32_t)(x)) << DMA_CH24_PRI_ECP_SHIFT)) & DMA_CH24_PRI_ECP_MASK)
/*! @} */

/*! @name TCD24_SADDR - TCD Source Address */
/*! @{ */

#define DMA_TCD24_SADDR_SADDR_MASK               (0xFFFFFFFFU)
#define DMA_TCD24_SADDR_SADDR_SHIFT              (0U)
/*! SADDR - Source Address */
#define DMA_TCD24_SADDR_SADDR(x)                 (((uint32_t)(((uint32_t)(x)) << DMA_TCD24_SADDR_SADDR_SHIFT)) & DMA_TCD24_SADDR_SADDR_MASK)
/*! @} */

/*! @name TCD24_SOFF - TCD Signed Source Address Offset */
/*! @{ */

#define DMA_TCD24_SOFF_SOFF_MASK                 (0xFFFFU)
#define DMA_TCD24_SOFF_SOFF_SHIFT                (0U)
/*! SOFF - Source Address Signed Offset */
#define DMA_TCD24_SOFF_SOFF(x)                   (((uint16_t)(((uint16_t)(x)) << DMA_TCD24_SOFF_SOFF_SHIFT)) & DMA_TCD24_SOFF_SOFF_MASK)
/*! @} */

