zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/MCX/MCXE/periph6/PERI_DMA.h
#define DMA_TCD25_BITER_ELINKYES_ELINK_MASK      (0x8000U)
#define DMA_TCD25_BITER_ELINKYES_ELINK_SHIFT     (15U)
/*! ELINK - Enable Link
 *  0b0..Channel-to-channel linking disabled
 *  0b1..Channel-to-channel linking enabled
 */
#define DMA_TCD25_BITER_ELINKYES_ELINK(x)        (((uint16_t)(((uint16_t)(x)) << DMA_TCD25_BITER_ELINKYES_ELINK_SHIFT)) & DMA_TCD25_BITER_ELINKYES_ELINK_MASK)
/*! @} */

/*! @name CH26_CSR - Channel Control and Status */
/*! @{ */

#define DMA_CH26_CSR_ERQ_MASK                    (0x1U)
#define DMA_CH26_CSR_ERQ_SHIFT                   (0U)
/*! ERQ - Enable DMA Request
 *  0b0..DMA hardware request signal for corresponding channel disabled
 *  0b1..DMA hardware request signal for corresponding channel enabled
 */
#define DMA_CH26_CSR_ERQ(x)                      (((uint32_t)(((uint32_t)(x)) << DMA_CH26_CSR_ERQ_SHIFT)) & DMA_CH26_CSR_ERQ_MASK)

#define DMA_CH26_CSR_EARQ_MASK                   (0x2U)
#define DMA_CH26_CSR_EARQ_SHIFT                  (1U)
/*! EARQ - Enable Asynchronous DMA Request In Stop Mode For Channel
 *  0b0..Disable asynchronous DMA request for the channel
 *  0b1..Enable asynchronous DMA request for the channel
 */
#define DMA_CH26_CSR_EARQ(x)                     (((uint32_t)(((uint32_t)(x)) << DMA_CH26_CSR_EARQ_SHIFT)) & DMA_CH26_CSR_EARQ_MASK)

#define DMA_CH26_CSR_EEI_MASK                    (0x4U)
#define DMA_CH26_CSR_EEI_SHIFT                   (2U)
/*! EEI - Enable Error Interrupt
 *  0b0..Error signal for corresponding channel does not generate error interrupt
 *  0b1..Assertion of error signal for corresponding channel generates error interrupt request
 */
#define DMA_CH26_CSR_EEI(x)                      (((uint32_t)(((uint32_t)(x)) << DMA_CH26_CSR_EEI_SHIFT)) & DMA_CH26_CSR_EEI_MASK)

#define DMA_CH26_CSR_EBW_MASK                    (0x8U)
#define DMA_CH26_CSR_EBW_SHIFT                   (3U)
/*! EBW - Enable Buffered Writes
 *  0b0..Buffered writes on system bus disabled
 *  0b1..Buffered writes on system bus enabled
 */
#define DMA_CH26_CSR_EBW(x)                      (((uint32_t)(((uint32_t)(x)) << DMA_CH26_CSR_EBW_SHIFT)) & DMA_CH26_CSR_EBW_MASK)

#define DMA_CH26_CSR_DONE_MASK                   (0x40000000U)
#define DMA_CH26_CSR_DONE_SHIFT                  (30U)
/*! DONE - Channel Done */
#define DMA_CH26_CSR_DONE(x)                     (((uint32_t)(((uint32_t)(x)) << DMA_CH26_CSR_DONE_SHIFT)) & DMA_CH26_CSR_DONE_MASK)

#define DMA_CH26_CSR_ACTIVE_MASK                 (0x80000000U)
#define DMA_CH26_CSR_ACTIVE_SHIFT                (31U)
/*! ACTIVE - Channel Active */
#define DMA_CH26_CSR_ACTIVE(x)                   (((uint32_t)(((uint32_t)(x)) << DMA_CH26_CSR_ACTIVE_SHIFT)) & DMA_CH26_CSR_ACTIVE_MASK)
/*! @} */

/*! @name CH26_ES - Channel Error Status */
/*! @{ */

#define DMA_CH26_ES_DBE_MASK                     (0x1U)
#define DMA_CH26_ES_DBE_SHIFT                    (0U)
/*! DBE - Destination Bus Error
 *  0b0..No destination bus error
 *  0b1..Last recorded error was bus error on destination write
 */
#define DMA_CH26_ES_DBE(x)                       (((uint32_t)(((uint32_t)(x)) << DMA_CH26_ES_DBE_SHIFT)) & DMA_CH26_ES_DBE_MASK)

#define DMA_CH26_ES_SBE_MASK                     (0x2U)
#define DMA_CH26_ES_SBE_SHIFT                    (1U)
/*! SBE - Source Bus Error
 *  0b0..No source bus error
 *  0b1..Last recorded error was bus error on source read
 */
#define DMA_CH26_ES_SBE(x)                       (((uint32_t)(((uint32_t)(x)) << DMA_CH26_ES_SBE_SHIFT)) & DMA_CH26_ES_SBE_MASK)

#define DMA_CH26_ES_SGE_MASK                     (0x4U)
#define DMA_CH26_ES_SGE_SHIFT                    (2U)
/*! SGE - Scatter/Gather Configuration Error
 *  0b0..No scatter/gather configuration error
 *  0b1..Last recorded error was a configuration error detected in the TCDn_DLAST_SGA field
 */
#define DMA_CH26_ES_SGE(x)                       (((uint32_t)(((uint32_t)(x)) << DMA_CH26_ES_SGE_SHIFT)) & DMA_CH26_ES_SGE_MASK)

#define DMA_CH26_ES_NCE_MASK                     (0x8U)
#define DMA_CH26_ES_NCE_SHIFT                    (3U)
/*! NCE - NBYTES/CITER Configuration Error
 *  0b0..No NBYTES/CITER configuration error
 *  0b1..Last recorded error was a configuration error detected in the TCDn_NBYTES or TCDn_CITER fields
 */
#define DMA_CH26_ES_NCE(x)                       (((uint32_t)(((uint32_t)(x)) << DMA_CH26_ES_NCE_SHIFT)) & DMA_CH26_ES_NCE_MASK)

#define DMA_CH26_ES_DOE_MASK                     (0x10U)
#define DMA_CH26_ES_DOE_SHIFT                    (4U)
/*! DOE - Destination Offset Error
 *  0b0..No destination offset configuration error
 *  0b1..Last recorded error was a configuration error detected in the TCDn_DOFF field
 */
#define DMA_CH26_ES_DOE(x)                       (((uint32_t)(((uint32_t)(x)) << DMA_CH26_ES_DOE_SHIFT)) & DMA_CH26_ES_DOE_MASK)

#define DMA_CH26_ES_DAE_MASK                     (0x20U)
#define DMA_CH26_ES_DAE_SHIFT                    (5U)
/*! DAE - Destination Address Error
 *  0b0..No destination address configuration error
 *  0b1..Last recorded error was a configuration error detected in the TCDn_DADDR field
 */
#define DMA_CH26_ES_DAE(x)                       (((uint32_t)(((uint32_t)(x)) << DMA_CH26_ES_DAE_SHIFT)) & DMA_CH26_ES_DAE_MASK)

#define DMA_CH26_ES_SOE_MASK                     (0x40U)
#define DMA_CH26_ES_SOE_SHIFT                    (6U)
/*! SOE - Source Offset Error
 *  0b0..No source offset configuration error
 *  0b1..Last recorded error was a configuration error detected in the TCDn_SOFF field
 */
#define DMA_CH26_ES_SOE(x)                       (((uint32_t)(((uint32_t)(x)) << DMA_CH26_ES_SOE_SHIFT)) & DMA_CH26_ES_SOE_MASK)

#define DMA_CH26_ES_SAE_MASK                     (0x80U)
#define DMA_CH26_ES_SAE_SHIFT                    (7U)
/*! SAE - Source Address Error
 *  0b0..No source address configuration error
 *  0b1..Last recorded error was a configuration error detected in the TCDn_SADDR field
 */
#define DMA_CH26_ES_SAE(x)                       (((uint32_t)(((uint32_t)(x)) << DMA_CH26_ES_SAE_SHIFT)) & DMA_CH26_ES_SAE_MASK)

#define DMA_CH26_ES_ERR_MASK                     (0x80000000U)
#define DMA_CH26_ES_ERR_SHIFT                    (31U)
/*! ERR - Error In Channel
 *  0b0..An error in this channel has not occurred
 *  0b1..An error in this channel has occurred
 */
#define DMA_CH26_ES_ERR(x)                       (((uint32_t)(((uint32_t)(x)) << DMA_CH26_ES_ERR_SHIFT)) & DMA_CH26_ES_ERR_MASK)
/*! @} */

/*! @name CH26_INT - Channel Interrupt Status */
/*! @{ */

#define DMA_CH26_INT_INT_MASK                    (0x1U)
#define DMA_CH26_INT_INT_SHIFT                   (0U)
/*! INT - Interrupt Request
 *  0b0..Interrupt request for corresponding channel cleared
 *  0b1..Interrupt request for corresponding channel active
 */
#define DMA_CH26_INT_INT(x)                      (((uint32_t)(((uint32_t)(x)) << DMA_CH26_INT_INT_SHIFT)) & DMA_CH26_INT_INT_MASK)
/*! @} */

