zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/MCX/MCXE/periph6/PERI_DMA.h
#define DMA_TCD29_NBYTES_MLOFFNO_NBYTES_MASK     (0x3FFFFFFFU)
#define DMA_TCD29_NBYTES_MLOFFNO_NBYTES_SHIFT    (0U)
/*! NBYTES - Number of Bytes To Transfer Per Service Request */
#define DMA_TCD29_NBYTES_MLOFFNO_NBYTES(x)       (((uint32_t)(((uint32_t)(x)) << DMA_TCD29_NBYTES_MLOFFNO_NBYTES_SHIFT)) & DMA_TCD29_NBYTES_MLOFFNO_NBYTES_MASK)

#define DMA_TCD29_NBYTES_MLOFFNO_DMLOE_MASK      (0x40000000U)
#define DMA_TCD29_NBYTES_MLOFFNO_DMLOE_SHIFT     (30U)
/*! DMLOE - Destination Minor Loop Offset Enable
 *  0b0..Minor loop offset not applied to DADDR
 *  0b1..Minor loop offset applied to DADDR
 */
#define DMA_TCD29_NBYTES_MLOFFNO_DMLOE(x)        (((uint32_t)(((uint32_t)(x)) << DMA_TCD29_NBYTES_MLOFFNO_DMLOE_SHIFT)) & DMA_TCD29_NBYTES_MLOFFNO_DMLOE_MASK)

#define DMA_TCD29_NBYTES_MLOFFNO_SMLOE_MASK      (0x80000000U)
#define DMA_TCD29_NBYTES_MLOFFNO_SMLOE_SHIFT     (31U)
/*! SMLOE - Source Minor Loop Offset Enable
 *  0b0..Minor loop offset not applied to SADDR
 *  0b1..Minor loop offset applied to SADDR
 */
#define DMA_TCD29_NBYTES_MLOFFNO_SMLOE(x)        (((uint32_t)(((uint32_t)(x)) << DMA_TCD29_NBYTES_MLOFFNO_SMLOE_SHIFT)) & DMA_TCD29_NBYTES_MLOFFNO_SMLOE_MASK)
/*! @} */

/*! @name TCD29_NBYTES_MLOFFYES - TCD Transfer Size with Minor Loop Offsets */
/*! @{ */

#define DMA_TCD29_NBYTES_MLOFFYES_NBYTES_MASK    (0x3FFU)
#define DMA_TCD29_NBYTES_MLOFFYES_NBYTES_SHIFT   (0U)
/*! NBYTES - Number of Bytes To Transfer Per Service Request */
#define DMA_TCD29_NBYTES_MLOFFYES_NBYTES(x)      (((uint32_t)(((uint32_t)(x)) << DMA_TCD29_NBYTES_MLOFFYES_NBYTES_SHIFT)) & DMA_TCD29_NBYTES_MLOFFYES_NBYTES_MASK)

#define DMA_TCD29_NBYTES_MLOFFYES_MLOFF_MASK     (0x3FFFFC00U)
#define DMA_TCD29_NBYTES_MLOFFYES_MLOFF_SHIFT    (10U)
/*! MLOFF - Minor Loop Offset */
#define DMA_TCD29_NBYTES_MLOFFYES_MLOFF(x)       (((uint32_t)(((uint32_t)(x)) << DMA_TCD29_NBYTES_MLOFFYES_MLOFF_SHIFT)) & DMA_TCD29_NBYTES_MLOFFYES_MLOFF_MASK)

#define DMA_TCD29_NBYTES_MLOFFYES_DMLOE_MASK     (0x40000000U)
#define DMA_TCD29_NBYTES_MLOFFYES_DMLOE_SHIFT    (30U)
/*! DMLOE - Destination Minor Loop Offset Enable
 *  0b0..Minor loop offset not applied to DADDR
 *  0b1..Minor loop offset applied to DADDR
 */
#define DMA_TCD29_NBYTES_MLOFFYES_DMLOE(x)       (((uint32_t)(((uint32_t)(x)) << DMA_TCD29_NBYTES_MLOFFYES_DMLOE_SHIFT)) & DMA_TCD29_NBYTES_MLOFFYES_DMLOE_MASK)

#define DMA_TCD29_NBYTES_MLOFFYES_SMLOE_MASK     (0x80000000U)
#define DMA_TCD29_NBYTES_MLOFFYES_SMLOE_SHIFT    (31U)
/*! SMLOE - Source Minor Loop Offset Enable
 *  0b0..Minor loop offset not applied to SADDR
 *  0b1..Minor loop offset applied to SADDR
 */
#define DMA_TCD29_NBYTES_MLOFFYES_SMLOE(x)       (((uint32_t)(((uint32_t)(x)) << DMA_TCD29_NBYTES_MLOFFYES_SMLOE_SHIFT)) & DMA_TCD29_NBYTES_MLOFFYES_SMLOE_MASK)
/*! @} */

/*! @name TCD29_SLAST_SDA - TCD Last Source Address Adjustment / Store DADDR Address */
/*! @{ */

#define DMA_TCD29_SLAST_SDA_SLAST_SDA_MASK       (0xFFFFFFFFU)
#define DMA_TCD29_SLAST_SDA_SLAST_SDA_SHIFT      (0U)
/*! SLAST_SDA - Last Source Address Adjustment / Store DADDR Address */
#define DMA_TCD29_SLAST_SDA_SLAST_SDA(x)         (((uint32_t)(((uint32_t)(x)) << DMA_TCD29_SLAST_SDA_SLAST_SDA_SHIFT)) & DMA_TCD29_SLAST_SDA_SLAST_SDA_MASK)
/*! @} */

/*! @name TCD29_DADDR - TCD Destination Address */
/*! @{ */

#define DMA_TCD29_DADDR_DADDR_MASK               (0xFFFFFFFFU)
#define DMA_TCD29_DADDR_DADDR_SHIFT              (0U)
/*! DADDR - Destination Address */
#define DMA_TCD29_DADDR_DADDR(x)                 (((uint32_t)(((uint32_t)(x)) << DMA_TCD29_DADDR_DADDR_SHIFT)) & DMA_TCD29_DADDR_DADDR_MASK)
/*! @} */

/*! @name TCD29_DOFF - TCD Signed Destination Address Offset */
/*! @{ */

#define DMA_TCD29_DOFF_DOFF_MASK                 (0xFFFFU)
#define DMA_TCD29_DOFF_DOFF_SHIFT                (0U)
/*! DOFF - Destination Address Signed Offset */
#define DMA_TCD29_DOFF_DOFF(x)                   (((uint16_t)(((uint16_t)(x)) << DMA_TCD29_DOFF_DOFF_SHIFT)) & DMA_TCD29_DOFF_DOFF_MASK)
/*! @} */

/*! @name TCD29_CITER_ELINKNO - TCD Current Major Loop Count (Minor Loop Channel Linking Disabled) */
/*! @{ */

#define DMA_TCD29_CITER_ELINKNO_CITER_MASK       (0x7FFFU)
#define DMA_TCD29_CITER_ELINKNO_CITER_SHIFT      (0U)
/*! CITER - Current Major Iteration Count */
#define DMA_TCD29_CITER_ELINKNO_CITER(x)         (((uint16_t)(((uint16_t)(x)) << DMA_TCD29_CITER_ELINKNO_CITER_SHIFT)) & DMA_TCD29_CITER_ELINKNO_CITER_MASK)

#define DMA_TCD29_CITER_ELINKNO_ELINK_MASK       (0x8000U)
#define DMA_TCD29_CITER_ELINKNO_ELINK_SHIFT      (15U)
/*! ELINK - Enable Link
 *  0b0..Channel-to-channel linking disabled
 *  0b1..Channel-to-channel linking enabled
 */
#define DMA_TCD29_CITER_ELINKNO_ELINK(x)         (((uint16_t)(((uint16_t)(x)) << DMA_TCD29_CITER_ELINKNO_ELINK_SHIFT)) & DMA_TCD29_CITER_ELINKNO_ELINK_MASK)
/*! @} */

/*! @name TCD29_CITER_ELINKYES - TCD Current Major Loop Count (Minor Loop Channel Linking Enabled) */
/*! @{ */

#define DMA_TCD29_CITER_ELINKYES_CITER_MASK      (0x1FFU)
#define DMA_TCD29_CITER_ELINKYES_CITER_SHIFT     (0U)
/*! CITER - Current Major Iteration Count */
#define DMA_TCD29_CITER_ELINKYES_CITER(x)        (((uint16_t)(((uint16_t)(x)) << DMA_TCD29_CITER_ELINKYES_CITER_SHIFT)) & DMA_TCD29_CITER_ELINKYES_CITER_MASK)

#define DMA_TCD29_CITER_ELINKYES_LINKCH_MASK     (0x3E00U)
#define DMA_TCD29_CITER_ELINKYES_LINKCH_SHIFT    (9U)
/*! LINKCH - Minor Loop Link Channel Number */
#define DMA_TCD29_CITER_ELINKYES_LINKCH(x)       (((uint16_t)(((uint16_t)(x)) << DMA_TCD29_CITER_ELINKYES_LINKCH_SHIFT)) & DMA_TCD29_CITER_ELINKYES_LINKCH_MASK)

#define DMA_TCD29_CITER_ELINKYES_ELINK_MASK      (0x8000U)
#define DMA_TCD29_CITER_ELINKYES_ELINK_SHIFT     (15U)
/*! ELINK - Enable Link
 *  0b0..Channel-to-channel linking disabled
 *  0b1..Channel-to-channel linking enabled
 */
#define DMA_TCD29_CITER_ELINKYES_ELINK(x)        (((uint16_t)(((uint16_t)(x)) << DMA_TCD29_CITER_ELINKYES_ELINK_SHIFT)) & DMA_TCD29_CITER_ELINKYES_ELINK_MASK)
/*! @} */

/*! @name TCD29_DLAST_SGA - TCD Last Destination Address Adjustment / Scatter Gather Address */
/*! @{ */

#define DMA_TCD29_DLAST_SGA_DLAST_SGA_MASK       (0xFFFFFFFFU)
#define DMA_TCD29_DLAST_SGA_DLAST_SGA_SHIFT      (0U)
/*! DLAST_SGA - Last Destination Address Adjustment / Scatter Gather Address */
#define DMA_TCD29_DLAST_SGA_DLAST_SGA(x)         (((uint32_t)(((uint32_t)(x)) << DMA_TCD29_DLAST_SGA_DLAST_SGA_SHIFT)) & DMA_TCD29_DLAST_SGA_DLAST_SGA_MASK)
/*! @} */

